Config/DataProcessors/ЗаданияОбменаБанкКазначейство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаданияОбменаБанкКазначейство</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/Documents/ЗаданиеНаЭкспортДанныхВБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаЭкспортДанныхВБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЕдиногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветWebСервиса</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ЗаданиеНаИмпортДанныхБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаИмпортДанныхБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузить</Name>
							<Comment>Выбрать файл для дальнейшей загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ЗаданияОбменаБанкКазначейство/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(ДокументыЭкспорта, ОтборОрганизация);
	ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(ДокументыИмпорта, ОтборОрганизация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧасти.Отбор, "Ссылка", Неопределено,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧастиИмпорта.Отбор, "Ссылка", Неопределено,,, Истина);
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗаданиеНаЭкспортДанныхВБанкиКС" Тогда
    	Элементы.ДокументыЭкспорта.Обновить();
		Элементы.ТабличныеЧасти.Обновить();
	ИначеЕсли ИмяСобытия = "Запись_ЗаданиеНаИмпортДанныхБанкиКС" Тогда
    	Элементы.ДокументыИмпорта.Обновить();
		Элементы.ТабличныеЧастиИмпорта.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборПоОрганизации();
	УстановитьОтборПоВидуОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЭкспортИмпортДокументовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьОтборПоОрганизации();
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОбменаПриИзменении(Элемент)
	УстановитьОтборПоВидуОбмена();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыДокументыЭкспорта

&НаКлиенте
Процедура ДокументыЭкспортаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
	//ПолеОтбора = НайтиполеОтбора("Ссылка", ТабличныеЧасти);
	//Если ПолеОтбора <> Неопределено тогда
	//	ПолеОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
	//	ПолеОтбора.Использование = Истина;
	//КонецЕсли;	
	//УстановитьОтборТабличнойЧастиЭкспорта();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыЭкспортаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТабличныеЧасти.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка 			= Ложь;
	
	Поле = Элементы.ТабличныеЧасти.ТекущийЭлемент;
	
	Если Поле.Имя = "ТабличныеЧастиОписаниеОшибки" Тогда
				
		Если ЗначениеЗаполнено(ТекущиеДанные.ОписаниеОшибки) Тогда
		
			ПараметрыФормыОшибок   = Новый Структура("СведенияОбОшибках",ТекущиеДанные.ОписаниеОшибки);
			ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.Форма.Ошибки", ПараметрыФормыОшибок, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТекущиеДанные.Объект) Тогда
			ПоказатьЗначение(Неопределено, ТекущиеДанные.Объект);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыДокументыИмпорта

&НаКлиенте
Процедура ДокументыИмпортаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
	//ПолеОтбора = НайтиполеОтбора("Ссылка", ТабличныеЧастиИмпорта);
	//Если ПолеОтбора <> Неопределено тогда
	//	ПолеОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
	//	ПолеОтбора.Использование = Истина;
	//КонецЕсли;	
	//УстановитьОтборТабличнойЧастиИмпорта();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыИмпортаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЧастиИмпортаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТабличныеЧастиИмпорта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка 			= Ложь;
	
	Поле = Элементы.ТабличныеЧастиИмпорта.ТекущийЭлемент;
	
	Если Поле.Имя = "ТабличныеЧастиИмпортаОписаниеОшибки" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ОписаниеОшибки) Тогда
		
			ПараметрыФормыОшибок   = Новый Структура("СведенияОбОшибках", ТекущиеДанные.ОписаниеОшибки);
			ОткрытьФорму("Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.Ошибки", ПараметрыФормыОшибок, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТекущиеДанные.Объект) Тогда
			ПоказатьЗначение(Неопределено, ТекущиеДанные.Объект);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоОрганизации()
	
	Если Элементы.ГруппаЭкспортИмпортДокументов.ТекущаяСтраница = Элементы.ГруппаДокументыЭкспорта Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыЭкспорта.Отбор, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	ИначеЕсли Элементы.ГруппаЭкспортИмпортДокументов.ТекущаяСтраница = Элементы.ГруппаДокументыИмпорта Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыИмпорта.Отбор, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	КонецЕсли;		
		
КонецПроцедуры // УстановитьОтборПоОрганизации()

&НаКлиенте
Процедура УстановитьОтборПоВидуОбмена()
	
	Если Элементы.ГруппаЭкспортИмпортДокументов.ТекущаяСтраница = Элементы.ГруппаДокументыЭкспорта Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыЭкспорта.Отбор, "ВидОбмена", ОтборВидОбмена,,, ЗначениеЗаполнено(ОтборВидОбмена));
	ИначеЕсли Элементы.ГруппаЭкспортИмпортДокументов.ТекущаяСтраница = Элементы.ГруппаДокументыИмпорта Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыИмпорта.Отбор, "ВидОбмена", ОтборВидОбмена,,, ЗначениеЗаполнено(ОтборВидОбмена));
	КонецЕсли;		
		
КонецПроцедуры // УстановитьОтборПоВидуОбмена()

&НаКлиенте
Процедура ПроверкаНеобходимостиЗаполнения()
	ТекущаяСтраница = Элементы.ГруппаЭкспортИмпортДокументов.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.ГруппаДокументыЭкспорта Тогда
		ТекущиеДанные = Элементы.ДокументыЭкспорта.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧасти.Отбор, "Ссылка", ПредопределенноеЗначение("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка"),,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧасти.Отбор, "Ссылка", ТекущиеДанные.Ссылка,,, Истина);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДокументыИмпорта Тогда
		ТекущиеДанные = Элементы.ДокументыИмпорта.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧастиИмпорта.Отбор, "Ссылка", ПредопределенноеЗначение("Документ.ЗаданиеНаИмпортДанныхБанкиКС.ПустаяСсылка"),,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ТабличныеЧастиИмпорта.Отбор, "Ссылка", ТекущиеДанные.Ссылка,,, Истина);
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРеестр(Команда)
		
	ОткрытьФорму("Отчет.РеестрВыгруженныхЭлектронныхДокументов.Форма");
	
КонецПроцедуры

#КонецОбласти
